# --- Formulas (CLI Tools) ---
brew "cowsay"
brew "direnv"
brew "node"
brew "firebase-cli"
brew "gemini-cli"
brew "hasura-cli"
brew "nvm"
brew "python@3.12"
brew "pnpm"
brew "yarn"
brew "mas"

# --- Casks (GUI Applications) ---
cask "jetbrains-toolbox"
cask "gitkraken"
cask "todoist"

# Tools - General
cask "google-chrome"
cask "raycast"
cask "scroll-reverser"
cask "shottr"

# --- Mac App Store Apps (Requires 'mas')
mas "DropOver", id: 1355679052